In [18]:
import pandas as pd
import numpy as np

dict={'Names':['Aru','Bhumika',None],
      'Salary':[20,np.nan,15],
      'Place':['Hyd','Vadodara','Milwaukee']}         
data=pd.DataFrame(dict)
data

     Names  Salary      Place
0      Aru    20.0        Hyd
1  Bhumika     NaN   Vadodara
2     None    15.0  Milwaukee

**fillna()**

In [20]:
data.to_csv('Sep13_valueAnalysis_fillna.csv',index=False)

In [21]:
data.dtypes

Names      object
Salary    float64
Place      object
dtype: object

In [22]:
data.fillna(5)

     Names  Salary      Place
0      Aru    20.0        Hyd
1  Bhumika     5.0   Vadodara
2        5    15.0  Milwaukee

In [25]:
dict2={'Name':['Aravind','Bhumika','Mayank',None],
       'Salary':[500,600,np.nan,700],
       'Place':['Hyd',None,'Milwaukee','Pune']}
data2=pd.DataFrame(dict2)
data2.dtypes

Name       object
Salary    float64
Place      object
dtype: object

In [34]:
data3=data2['Name'].fillna('Gullu')
data3
data4=data2['Salary'].fillna('800')
data4.astype('int')
data4

0    500.0
1    600.0
2      800
3    700.0
Name: Salary, dtype: object

In [35]:
data2

      Name  Salary      Place
0  Aravind   500.0        Hyd
1  Bhumika   600.0       None
2   Mayank     NaN  Milwaukee
3     None   700.0       Pune

In [44]:
import warnings as wr
wr.filterwarnings('ignore')
data3=data2.fillna(method='pad',axis=1)
data3

      Name  Salary      Place
0  Aravind   500.0        Hyd
1  Bhumika   600.0      600.0
2   Mayank  Mayank  Milwaukee
3     None   700.0       Pune